/* Filler for a specific service running at a time, e.g., '396 at 11:56am' */
" at " = " lúc ";

/* Filler for a specific frequency-based service indicating its frequency, e.g., 'M10 every 10 minutes' */
" every " = " mỗi ";

/* Action title for adding another habitual visit to a favourite */
"Add habitual visit" = "Thêm thói quen";

/* Add reminder activity title */
"Add Reminder" = "Thêm Nhắc nhở";

/* Save trip action */
"Add to Agenda" = "Thêm vào Lịch Trình";

/* Add to calendar activity title */
"Add to Calendar" = "Thêm vào Lịch";

/* Add favourite activity title */
"Add to Favourites" = "Thêm vào Yêu Thích";

/* No comment provided by engineer. */
"Add to favourites" = "Thêm vào yêu thích";

/* Action title for adding a vehicle */
"Add vehicle" = "Thêm phương tiện";

/* Add to agenda HUD notice */
"Added to Agenda" = "Đã thêm vào Lịch Trình";

/* Added to calendar HUD message */
"Added to calendar" = "Đã thêm vào Lịch";

/* Add a new stopover */
"AddStopover" = "Add stopover...";

/* Agenda title */
"Agenda" = "Lịch Trình";

/* No comment provided by engineer. */
"Agenda cleared" = "Đã dọn dẹp Lịch Trình";

/* Agenda button name
   Agenda tab bar name */
"AgendaButton" = "Lịch Trình";

/* Airline flight number with %airline and %flightNumber, e.g., 'Qantas flight QF1' */
"AirlineFlightNumber" = "%@ chuyến bay %@";

/* Flight from a city to an other one */
"AirlineFromTo" = "%@ (%@) đến %@ (%@)";

/* No comment provided by engineer. */
"Alert" = "Thông báo";

/* Description of alert with %title */
"AlertTitleFormat" = "Thông báo: %@";

/* Option to delete only all related events in a recurence */
"All" = "Tất cả";

/* Option to delete this event and all after in a recurence */
"All From Here" = "Tất cả từ đây";

/* Action button title to see alternative options for the case where you can't make the next connection. */
"Alternative routes" = "Các tuyến đường thay thế";

/* No comment provided by engineer. */
"Ambiguous event address." = "Địa chỉ không rõ ràng.";

/* apple maps directions action */
"Apple Maps" = "Apple Maps";

/* Arrival time sorter title */
"Arrival" = "Thời gian đến";

/* Arrive field title */
"Arrive " = "Đến ";

/* Arrive before button */
"ArriveBefore" = "Đến nơi vào lúc";

/* Filler for a service running at time, e.g., 'At 11:56am' */
"At " = "Lúc ";

/* Distance 'automatic' */
"Auto" = "Tự động";

/* Agenda item for going back to a previous event which has %name */
"BackToPreviousLocationFormat" = "Quay trở lại %@";

/* No comment provided by engineer. */
"Book a shuttle" = "Đặt một shuttle";

/* vehicle booking action */
"Book vehicle" = "Đặt trước phương tiện";

/* Book a shuttle */
"BookShuttle" = "Đặt Shuttle";

/* Book a taxi */
"BookTaxi" = "Đặt Taxi";

/* No comment provided by engineer. */
"Cache" = "Cache";

/* No comment provided by engineer. */
"Cache cleared" = "Đã xóa Cache";

/* Calendar */
"Calendar" = "Lịch";

/* Type for regular events that go in the phone's calendar. */
"Calendar Event" = "Sự kiện";

/* No comment provided by engineer. */
"Calendars" = "Lịch";

/* No comment provided by engineer. */
"Call Taxi" = "Gọi Taxi";

/* Action title for calling taxi provider of %name */
"CallTaxiFormat" = "Gọi %@";

/* Cancel - for action sheets
   Cancel action */
"Cancel" = "Hủy";

/* No comment provided by engineer. */
"Change time" = "Đổi thời gian";

/* Agenda cleaner title */
"Cleaner" = "Dọn dẹp";

/* clear cache preference */
"Clear cache" = "Xóa cache";

/* clear search history preference */
"Clear search history" = "Xóa lịch sử tìm kiếm";

/* No comment provided by engineer. */
"Clearing agenda..." = "Đang dọn dẹp Lịch Trình...";

/* No comment provided by engineer. */
"Clearing cache..." = "Đang dọn dẹp cache...";

/* No comment provided by engineer. */
"Clearing history..." = "Đang dọn dẹp lịch sử...";

/* School pricing preference */
"Concession Pricing" = "Concession Pricing";

/* Hassle preference */
"Convenience" = "Convenience";

/* Convenience description */
"Convenience is affected by things such as changing public transport services, the amount of walking, and finding a taxi." = "Convenience is affected by things such as changing public transport services, the amount of walking, and finding a taxi.";

/* Location manager failure error message */
"Could not determine your current location. Please set your location manually." = "Could not determine your current location. Please set your location manually.";

/* Could not download supported regions warning */
"CouldNotDownloadSupportedRegions" = "Could not download supported regions from TripGo's server. Please try again later.";

/* Description for how to redeem the coupon code for ingogo. %couponCode is provided. */
"CouponCodeIngogoFormat" = "Enter coupon code '%@' when registering to claim your free $5 credit (only valid for new registrations)";

/* Title for critical error */
"CriticalError" = "Critical Error";

/* Description for critical error where %errorMessage is provided. */
"CriticalErrorFormat" = "The application encountered a critical error and can't recover:\n\n%@";

/* No comment provided by engineer. */
"Custom trip does not fit" = "Custom trip does not fit";

/* Cycling speed preference */
"Cycle speed" = "Cycle speed";

/* From %date */
"DateFromFormat" = "From %@";

/* From %date1 to %date2 */
"DateFromToFormat" = "From %@ to %@";

/* Departure time sorter title */
"Departure" = "Departure";

/* Dismiss accessibility label */
"Dismiss" = "Dismiss";

/* Distances preference */
"Distances" = "Distances";

/* Walkthrough (skip in here should match translation for 'Skip'. */
"Don't have a fixed place of work or study? Skip this step." = "Don't have a fixed place of work or study? Skip this step.";

/* Done button */
"Done" = "Done";

/* Title for date when an event ends repeating */
"End Date" = "End Date";

/* Carbon preference */
"Environment" = "Environment";

/* No comment provided by engineer. */
"Error clearing agenda" = "Error clearing agenda";

/* No comment provided by engineer. */
"Error clearing cache" = "Error clearing cache";

/* No comment provided by engineer. */
"Error clearing history" = "Error clearing history";

/* No comment provided by engineer. */
"Event" = "Event";

/* No comment provided by engineer. */
"Event does not fit" = "Event does not fit";

/* No comment provided by engineer. */
"Event is missing an address." = "No address";

/* No comment provided by engineer. */
"Event is outside TripGo's range." = "Outside TripGo's range";

/* No comment provided by engineer. */
"Event was cancelled" = "Event was cancelled";

/* Title for the time an event ends (including date information) */
"EventEndDateTime" = "End";

/* Title for the time an event ends (without date information) */
"EventEndTime" = "End";

/* Title for when an event repeats */
"EventRepeat" = "Repeats";

/* Title for the time an event starts (including date information) */
"EventStartDateTime" = "Start";

/* Title for the time an event starts (without date information) */
"EventStartTime" = "Start";

/* Filler for a frequency-based service indicating its frequency, e.g., 'Every 10 minutes' */
"Every " = "Every ";

/* Action title to exclude an event from routing
   Exclude event action */
"Exclude" = "Exclude";

/* There goes my excuse for being late... */
"ExcuseDueToLate" = "TripGo - There goes my excuse for being late...";

/* Speed preference 'fast' */
"Fast" = "Fast";

/* No comment provided by engineer. */
"Favourite" = "Favourite";

/* Add favourite HUD notice */
"Favourite added" = "Favourite added";

/* Remove trip from favourites HUD notice */
"Favourite removed" = "Favourite removed";

/* No comment provided by engineer. */
"Favourites" = "Favourites";

/* Favourites button name
   Favourites tab bar name */
"FavouritesButton" = "Favourites";

/* Help title */
"Feedback & Support" = "Feedback & Support";

/* Placeholder text for search bar that is used for filtering */
"Filter" = "Filter";

/* Flight */
"Flight" = "Flight";

/* Flight number prompt */
"Flight number" = "Flight number";

/* Date of the flight */
"FlightDate" = "Date";

/* Details of a flight */
"FlightDetails" = "Details";

/* Note concerning the flight */
"FlightNote" = "Note";

/* Title for flight with %flightNumber */
"FlightNumberFormat" = "Flight %@";

/* Search for a flight */
"FlightSearch" = "Search for a flight";

/* Reminder to leave preference */
"For when to leave" = "For when to leave";

/* Free directions */
"FreeDirections" = "TripGo - Free directions";

/* Route here... ...from Current location */
"From current location" = "From current location";

/* Location for trip exported as event going from %location1 to %location2 */
"FromToForEventLocationFormat" = "From %@ to %@";

/* Header for list of vehicles garaged at this location */
"Garaged Vehicles" = "Garaged Vehicles";

/* Title of settings for generic transport stuff */
"General" = "General";

/* Action button title for getting turn-by-turn directions */
"Get directions" = "Get directions";

/* No comment provided by engineer. */
"Get ingogo" = "Get ingogo";

/* Header for settings for feedback, recommending and rating TripGo */
"Get Involved" = "Get Involved";

/* No comment provided by engineer. */
"Get Uber ($20 credit^)" = "Get Uber ($20 credit^)";

/* I use TripGo to get around */
"GetAround" = "I use TripGo to get around.";

/* goCatch action */
"goCatch a Taxi" = "goCatch a Taxi";

/* google maps directions action */
"Google Maps" = "Google Maps";

/* Type for events that are regular visit's to one of the user's favorites */
"Habitual Visit" = "Routine";

/* Header for habitual visits, i.e., when a user is typically at this location */
"Habitual Visits" = "Routines";

/* Explanation for what habitual events are. Can be long-ish. */
"HabitualEventDescription" = "Routines are part of your daily movement, but they aren't events that you want in your calendar (e.g., work). They are important for the Agenda to get you to the right location at the right time.";

/* No comment provided by engineer. */
"History cleared" = "History cleared";

/* Typical name that you'd give your home location */
"Home" = "Home";

/* Map mode 'streets + satellite' */
"Hybrid" = "Hybrid";

/* Action title to include an event in routing
   Include event action */
"Include" = "Include";

/* Title for a switch indicating if this event should be included in all-day routes */
"Include in routes" = "Include in routes";

/* School services footer */
"Information on school services and concession pricing is subject to availability." = "Information on school services and concession pricing is subject to availability.";

/* No comment provided by engineer. */
"ingogo a Taxi" = "ingogo a Taxi";

/* No comment provided by engineer. */
"ingogo a Taxi ($5 credit^)" = "ingogo a Taxi ($5 credit^)";

/* Accessibility hint for tapping title in agenda - jumps to 'today' */
"Jump to today" = "Jump to today";

/* Distance 'kilometers' */
"Km" = "Km";

/* Leave field title */
"Leave " = "Leave ";

/* No comment provided by engineer. */
"Leave now" = "Leave now";

/* Leave after button */
"LeaveAfter" = "Leave at";

/* Button title to switch view to list mode */
"List" = "List";

/* list providers action */
"List Taxi Numbers" = "List Taxi Numbers";

/* Title for showing the details of a location, typically picked from the map after searching or dropping a pin */
"Location" = "Location";

/* No comment provided by engineer. */
"Location missing." = "Location missing.";

/* Where are you going from? */
"LocationComingFrom" = "Where are you going from?";

/* Where do you want to go? */
"LocationWantToGo" = "Where do you want to go?";

/* No comment provided by engineer. */
"Long press on the map to choose a location" = "Long press on the map to choose a location";

/* I once was lost but now I have found... TripGo */
"LostOnce" = "I once was lost but now I have found... TripGo.";

/* Button title to switch agenda view to map mode
   Button title to switch to map
   Map preference */
"Map" = "Map";

/* No comment provided by engineer. */
"Marking a location as a favourite will allow quick access to routing results for going there from your current location." = "Favorite locations give you quick trip solutions from wherever you are.";

/* No comment provided by engineer. */
"Marking a transit stop as a favourite will allow quick access to its timetable." = "Marking a transit stop as a favourite will allow quick access to its timetable.";

/* Speed preference 'medium' */
"Medium" = "Medium";

/* Distance 'miles' */
"Mi" = "Mi";

/* Minimum transfer time preference */
"Min transfer time" = "Min transfer time";

/* Number of minutes */
"Minutes" = "%.0f minutes";

/* Reminder to leave preference */
"Minutes before trip" = "Minutes before trip";

/* Number of minutes before departure */
"MinutesBefore" = "%.0f minutes before";

/* More button accessibility label */
"More" = "More";

/* No comment provided by engineer. */
"More Options" = "More Options";

/* User preferences title */
"My Priorities" = "My Priorities";

/* No comment provided by engineer. */
"My Vehicles" = "My Vehicles";

/* Name of the vehicle */
"NameVehicle" = "Name";

/* No comment provided by engineer. */
"New Favourite" = "New Favourite";

/* Title for unnamed new event */
"NewEvent" = "New event";

/* Button title to complete this step and advance to next */
"Next" = "Next";

/* No comment provided by engineer. */
"No 'From' location selected" = "No 'From' location selected";

/* No comment provided by engineer. */
"No 'To' location selected" = "No 'To' location selected";

/* Error for when no calendar found. */
"No calendar found. Please check your Calendar app and make sure you have a calendar configured." = "No calendar found. Please check your Calendar app and make sure you have a calendar configured.";

/* No comment provided by engineer. */
"No locations set" = "No locations set";

/* Countdown cell 'now' indicator */
"Now" = "Now";

/* Title for route number %1 of %total, where %total > 1. */
"NumberRouteFormat" = "Route %ld of %ld";

/* Results screen error ok button */
"OK" = "OK";

/* Option to delete only this event in a recurence */
"Only This" = "Only This";

/* Open in Safari action */
"Open in Safari" = "Open in Safari";

/* No comment provided by engineer. */
"Open Uber" = "Open Uber";

/* Button title to open URL */
"Open URL" = "Open URL";

/* shuttle website action */
"Open Website" = "Open Website";

/* Text displayed when the user has given the app access to private data such as their calendar or contacts, but the user needs to perform the original action again to now see the results. */
"Permission was granted. Please go back and try again." = "Permission was granted. Please go back and try again.";

/* No comment provided by engineer. */
"Permissions" = "Permissions";

/* Timetable screen title */
"Pick a Time" = "Pick a Time";

/* Description of the pricing */
"pricingDescription" = "Price";

/* Notification message for a non-public transport trip. Provided is %destination and %time you need to leave. */
"PrivateTimeToLeave" = "Time to leave! Your trip to %@ commences at %@";

/* Notification message for catching public transport. Provided is %mode (e.g., bus), %destination and %time you need to leave. */
"PublicTimeToLeaveToFormat" = "Time to leave! Your %@ trip to %@ commences at %@";

/* Notification message for catching public transport. Provided is %mode (e.g., bus), %busNumber, %destination and %time you need to leave. */
"PublicTimeToLeaveToOnFormat" = "Your %@ trip on %@ to %@ commences at %@";

/* Rate us preference */
"Rate TripGo" = "Rate TripGo";

/* Refining current location HUD notice */
"Refining location" = "Refining location";

/* Added reminder notice */
"Reminder added" = "Reminder added";

/* Removed reminder HUD notice */
"Reminder removed" = "Reminder removed";

/* Reminders title */
"Reminders" = "Reminders";

/* Remove favourite activity title */
"Remove Favourite" = "Remove Favourite";

/* Unsave trip action */
"Remove from Agenda" = "Remove from Agenda";

/* Remove reminder activity title */
"Remove Reminder" = "Remove Reminder";

/* Remove from agenda HUD notice */
"Removed from Agenda" = "Removed from Agenda";

/* Title for switch indicating if an event repeats or not */
"Repeat does end" = "Repeat does end";

/* Report problem */
"Report Problem" = "Report Problem";

/* Title for action to perform by the user if an event is outside TripGo's range. The action will display a feedback form to request the region of that event. */
"Request..." = "Request...";

/* Error when location search for %input was not successful. */
"RequestErrorFormat" = "'%@' not found.";

/* segment membership required action */
"Requires membership" = "Requires membership";

/* Reset button for my priorities
   Title of group of settings related to resetting settings */
"Reset" = "Reset";

/* Action title to reset agenda content. */
"Reset agenda" = "Reset agenda";

/* Action title to reset tutorial progress. */
"Reset tutorial" = "Reset tutorial";

/* No comment provided by engineer. */
"Route" = "Route";

/* Title for options for routing to this location, options are: current location, <some previously selected location>. */
"Route here" = "Route here";

/* Results screen title */
"Routes" = "Routes";

/* Map mode 'satellite' */
"Satellite" = "Satellite";

/* Price preference */
"Save Money" = "Save Money";

/* Time preference */
"Save Time" = "Save Time";

/* No comment provided by engineer. */
"Search for a city" = "Search for a city";

/* Agenda onboarding: placeholder text for search bar for 'home'. */
"Search for your home address" = "Search for your home address";

/* Agenda onboarding: placeholder text for search bar for 'work'. */
"Search for your work address" = "Search for your work address";

/* Search tab bar name */
"SearchButton" = "Search";

/* Details of a flight prompt to enter date first. */
"Select a date to get flight details." = "Select a date to get flight details.";

/* Walkthrough */
"Select the place where you stay at the end of each day" = "Select the place where you stay at the end of each day.";

/* No comment provided by engineer. */
"Select Vehicle" = "Select Vehicle";

/* Action button title for composing an SMS to a real-time service */
"Send Real-time SMS" = "Send Real-time SMS";

/* No comment provided by engineer. */
"Set location..." = "Set location...";

/* No comment provided by engineer. */
"Settings" = "Settings";

/* Settings tab bar name */
"SettingsButton" = "Settings";

/* Action button title for sharing when you arrive
   Share arrival */
"Share Arrival" = "Share Arrival";

/* Share trip */
"Share Trip" = "Share Trip";

/* Button title on trips to show alternatives for it */
"Show alternatives" = "Show alternatives";

/* No comment provided by engineer. */
"Show booking options" = "Show booking options";

/* No comment provided by engineer. */
"Show details" = "Show details";

/* No comment provided by engineer. */
"Show info" = "Show info";

/* Action button title for viewing timetable for public transport */
"Show timetable" = "Show timetable";

/* Show trip */
"ShowTrip" = "Show Trip";

/* Button title to skip a certain step */
"Skip" = "Skip";

/* Speed preference 'slow' */
"Slow" = "Slow";

/* Results screen error title */
"Sorry" = "Sorry";

/* No comment provided by engineer. */
"Sorry. TripGo doesn't work here yet!" = "Sorry. TripGo doesn't work here yet!";

/* Spread the word preference */
"Spread the word" = "Spread the word";

/* Title for flight going from %airport1 (%airportCode2) to %airport3 (%airportCode4) */
"SrcToDstFormat" = "%@ (%@) to %@ (%@)";

/* No comment provided by engineer. */
"Start of Week" = "Start of Week";

/* Number of steps */
"StepsNumber" = "%@ steps taken";

/* Map mode 'streets' */
"Streets" = "Streets";

/* Contact support error button */
"Support" = "Support";

/* Walkthrough */
"Swipe dates to navigate between weeks" = "Swipe dates to navigate between weeks.";

/* No comment provided by engineer. */
"Tab Bar" = "Tab Bar";

/* Walkthrough - should match translation for '\"Routes\"' */
"Tap 'Routes' for alternative routes" = "Tap 'Routes' for alternative routes.";

/* Walkthrough */
"Tap and hold title to jump directly to a specified date." = "Tap and hold title to jump directly to a specified date.";

/* Walkthrough */
"Tap public transport stops for access to timetable" = "Tap public transport stops for access to timetable.";

/* Walkthrough */
"Tap title to go to 'today'" = "Tap title to go to 'today'";

/* No comment provided by engineer. */
"Tap to set garage" = "Tap to set garage";

/* No comment provided by engineer. */
"Taxi Providers" = "Taxi Providers";

/* Description of the terminal */
"terminalDescription" = "Terminal";

/* Thank you HUD notice */
"Thank you!" = "Thank you!";

/* Results screen internal error message */
"There was a problem on our side. We will investigate." = "There was a problem on our side. We will investigate.";

/* Title for screen to pick your working hours */
"Time at Work" = "Time at Work";

/* Timetable title */
"Timetable" = "Timetable";

/* Title event name */
"TitleEventName" = "Title";

/* Title favourite name */
"TitleFavouriteName" = "Title";

/* Title of settings for generic transport stuff */
"Transport" = "Transport";

/* Transport genius */
"TransportGenius" = "TripGo - Transport genius";

/* How do you want to go today? */
"TransportModeWish" = "TripGo - How do you want to go today?";

/* No comment provided by engineer. */
"Trip" = "Trip";

/* No comment provided by engineer. */
"TripGo does not work in this area yet. Please navigate to on of our supported regions and try again." = "TripGo does not work in this area yet. Please navigate to on of our supported regions and try again.";

/* Confirmation that tutorial was reset. */
"Tutorial reset" = "Tutorial reset";

/* Type of the vehicle */
"TypeVehicle" = "Type";

/* No comment provided by engineer. */
"Uber" = "Uber";

/* No comment provided by engineer. */
"Verify location..." = "Verify location...";

/* View alternative times for this trip */
"View times" = "View times";

/* Duration button */
"ViewDurationButton" = "Duration";

/* Overall button */
"ViewOverallButton" = "Preferred";

/* Price button */
"ViewPriceButton" = "Price";

/* Walking speed preference */
"Walk speed" = "Walk speed";

/* Results screen no results error */
"We didn't find any results for your query." = "We didn't find any results for your query.";

/* Question for which events in a recurrence to delete (options are typically this/all/any from here) */
"Which would you like to delete" = "Which would you like to delete";

/* Typical name that you'd give your work location */
"Work" = "Work";

/* No comment provided by engineer. */
"Zoom in" = "Zoom in";

/* Walkthrough */
"Zoom into map to view public transport stops" = "Zoom into map to view public transport stops.";

